#===============================================================================
# 1부터 45까지 숫자를 랜덤으로 섞어
# 배열 0번째 인덱스부터 5번인덱스까지 출력 (6개)
#===============================================================================
from random import random
# arr = list(range(1,45+1))
arr = [
    1,2,3,4,5, 6,7,8,9,10,
    11,12,13,14,15, 16,17,18,19,20,
    21,22,23,24,25, 26,27,28,29,30,
    31,32,33,34,35, 36,37,38,39,40,
    41,42,43,44,45
]
    
for i in range(100):
    rnd = int(random() * 45)
    temp = arr[0]
    arr[0] = arr[rnd]
    arr[rnd] = temp

lotto =""
for i in range(5):
    lotto += str(arr[i]) + " "
    
print(lotto)


    